# 泡沫排序
"""
泡沫排序 (Bubble Sort) 想法是這樣的，假設要由小排到大，
左邊為小右邊為大，以左邊第一個為基準點，不斷的跟右邊的值比大小，
比較小的就往左，大的就停住，然後再從這個 礙事的 大的值繼續往右比。
如果到很不幸馬上就遇到更大的，再從更大的往右比，直到最後一個位置。
現在，已經比完第一輪了，接著再從最左邊的頭開始，往下比下去。

我們用比身高來舉例，分為 1 到 10 ：
矮 ------------------------------------> 高
8　6　1　10　5　3　9　2　7　4
6　8　1　10　5　3　9　2　7　4
6　1　8　10　5　3　9　2　7　4

可惡，8 碰到 10 過不去了，那就只好讓 10 繼續比下去。
6　1　8　10　5　3　9　2　7　4
6　1　8　5　10　3　9　2　7　4
6　1　8　5　3　10　9　2　7　4
6　1　8　5　3　9　10　2　7　4
6　1　8　5　3　9　2　10　7　4
6　1　8　5　3　9　2　7　10　4
6　1　8　5　3　9　2　7　4　10

現在 10 撞牆了，已經稱霸沒得比了，所以再從頭的 6 開始往右比。
6　1　8　5　3　9　2　7　4　10
1　6　8　5　3　9　2　7　4　10
1　8　6　5　3　9　2　7　4　10

程式時間複雜度：O(N^2)
"""

data = [89, 34, 23, 78, 67, 100, 66, 29, 79, 55, 78, 88, 92, 96, 96, 23]

# 結果: data = [23, 23, 29, 34, 55, 66, 67, 78, 78, 79, 88, 89, 92, 96, 96, 100]

def bubble_sort(data):
    n = len(data)
    # 利用雙重迴圈去做循環比較

    for i in range(n-2):      # 有 n 個資料長度但只要執行 n-1 次
        for j in range(n-i-1):
            if j != len(data)-1:
                # temp1 = data[j]
                # temp2 = data[j+1]
                # print(temp1, temp2)
                if data[j] > data[j+1]:
                    """互換方式1"""
                    # data[j] = temp2
                    # data[j+1] = temp1
                    """互換方式2"""
                    data[j], data[j+1] = data[j+1], data[j]
    print(data)

bubble_sort(data)